sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
			if (ticks - lastButtonRefresh >= 250)
			{
				//update button status every 250ms.
				buttonRetransmit++;
				lastButtonRefresh = ticks;
			}
		}
		
		if (vibrationStopTime && (ticks > vibrationStopTime))
		{
			HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_RESET);
			vibrationStopTime = 0;
		}
		
		float elapsedTime = (now - lastRotationUpdate) / 1000000.0f; // set integration time by time elapsed since last filter update				
		
		if (elapsedTime >= 0.005f) //update at 200hz
		{	
			hasRotationData |= readAccelData(tSensorData.Accel.Raw);  // Read the x/y/z adc values			
			hasRotationData |= readGyroData(tSensorData.Gyro.Raw); 
			hasRotationData |= readMagData(tSensorData.Mag.Raw);
					
			
			if (hasRotationData) // recalc position if still has position data to be sent
			{
				tSensorData.Accel.ProcessNew();
				tSensorData.Gyro.ProcessNew();
				tSensorData.Mag.ProcessNew();
				
				tSensorData.TimeElapsed = elapsedTime;
				lastRotationUpdate = now;	
				orientQuat = orientFuse.FuseOrient(&tSensorData);						

				//gravQuat = orientQuat;
//				gravQuat.w = 0; gravQuat.x = 0; gravQuat.y = 0; gravQuat.z = 0;
//				gravQuat = (orientQuat * gravQuat) * orientQuat.conjugate();

				if (isPositionReady && (hasPositionData || (isCalibrated && (ticks >= 10000))))
				{
					//float elapsedPositionTime = (float)(now - lastPositionIntegrateTime) / 1000000.0f;
					//if (elapsedPositionTime >= 0.001f) // integrate every 2 ms
					{
						GravityVector[0] = 2.0f * (orientQuat.x * orientQuat.z - orientQuat.w * orientQuat.y);
						GravityVector[1] = 2.0f * (orientQuat.w * orientQuat.x + orientQuat.y * orientQuat.z);
						GravityVector[2] = orientQuat.w * orientQuat.w - orientQuat.x * orientQuat.x - orientQuat.y * orientQuat.y + orientQuat.z * orientQuat.z;
						
						for (int i=0; i<3; i++)
						{
							float prevAccel = CompAccelVector[i];
							float prevVelocity = VelocityVector[i];																									
							float newAccel = tSensorData.Accel.Converted[i] - GravityVector[i];
							float newVelocity = ((prevAccel + newAccel) / 2.0f) * 9.81f * elapsedTime;		
							float prevPosition = position.Position[i];
							
							//if velocity changes direction hold for a moment
//							if (sgn(prevVelocity) != sgn(newVelocity))
//							{
//								newVelocity = prevVelocity = 0;
//								//newAccel = 0;
//							}
							
							
							position.Position[i] = prevPosition + ((prevVelocity + newVelocity) / 2.0f) * elapsedTime * 10.0f;											
							CompAccelVector[i] = newAccel;
							VelocityVector[i] = prevVelocity + newVelocity;							
						}	
						
						//if (now - lastPositionSend >= 20000) //50 ms
						{
							positionQuat.w = 0;
							positionQuat.x = position.Position[0];
							positionQuat.y = position.Position[1];
							positionQuat.z = position.Position[2];
							
							positionQuat = (orientQuat * positionQuat) * orientQuat.conjugate();
							
							hasPositionData = 1;							
							//lastPositionSend = now;	
						}
						
						//lastPositionIntegrateTime = now;
					}
				}
				//else
				//	lastPositionIntegrateTime = now;
			}
		}

		rfStatus = RF_Status(&hspi2);
		readyToReceive = (rfStatus & RF_RX_DR_IRQ_CLEAR) == RF_RX_DR_IRQ_CLEAR ? 1 : 0;

		if (readyToReceive)
		{
			rfStatus = RF_FifoStatus(&hspi2);
			readyToReceive = (rfStatus & RF_RX_FIFO_EMPTY_Bit) == 0x00 ? 1: 0;
			while (readyToReceive)
			{			
				rcvCounter++;
				//receive command
				//has fifo, receive
				readyToReceive = RF_ReceivePayload(&hspi2, (uint8_t*)pUSBCommandPacket, sizeof(USBPacket)) == 0 ? 1: 0; //if not empty 
				
				if (CheckPacketCrc(pUSBCommandPacket) && ((pUSBCommandPacket->Header.Type & 0x0F)) == ctlSource)
				{
					if (lastCommandSequence != pUSBCommandPacket->Header.Sequence) //discard duplicates
					{
						lastCommandSequence = pUSBCommandPacket->Header.Sequence; 
						switch (pUSBCommandPacket->Command.Command)
						{
							case CMD_RAW_DATA:								
								feedRawMode = (RawModes) pUSBCommandPacket->Command.Data.Raw.State;
								break;
							case CMD_VIBRATE:
								vibrationStopTime = ticks + pUSBCommandPacket->Command.Data.Vibration.Duration;
								HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_SET);							
								break;
							case CMD_CALIBRATE:
								//manually set sensor offsets
								int sensorId = pUSBCommandPacket->Command.Data.Calibration.Sensor;																
								for (int i=0; i<3; i++)
								{
									position.Position[i] = 0;
									VelocityVector[i] = 0;
									//AccelVector[i] = 0;
									CompAccelVector[i] = 0;
								}
								if (sensorId == SENSOR_NONE)
									break;
								else if (sensorId == SENSOR_ACCEL)
								{
									for (int i=0; i<3; i++)
									{
										tSensorData.Accel.PosScale[i] = (1.0f / aRes) / (float)pUSBCommandPacket->Command.Data.Calibration.PosScale[i];
										tSensorData.Accel.NegScale[i] = (1.0f / aRes) / (float)pUSBCommandPacket->Command.Data.Calibration.NegScale[i];
									}
									calibrationCache.Accel = pUSBCommandPacket->Command.Data.Calibration;
								}
								else if (sensorId == SENSOR_GYRO)
								{
									for (int i=0; i<3; i++)
									{
										tSensorData.Gyro.PosScale[i] = pUSBCommandPacket->Command.Data.Calibration.PosScale[i];
										tSensorData.Gyro.NegScale[i] = 0;
									}
									calibrationCache.Gyro = pUSBCommandPacket->Command.Data.Calibration;
								}
								else if (sensorId == SENSOR_MAG)
								{
									for (int i=0; i<3; i++)
									{
										tSensorData.Mag.PosScale[i] = (1.0f / mRes) / (float)pUSBCommandPacket->Command.Data.Calibration.PosScale[i];
										tSensorData.Mag.NegScale[i] = (1.0f / mRes) / (float)pUSBCommandPacket->Command.Data.Calibration.NegScale[i];
									}
									calibrationCache.Mag = pUSBCommandPacket->Command.Data.Calibration;
								}
								eepromSaveTime = ticks + 1000; //save after 1 second
								//lastPositionIntegrateTime = 
								//lastPositionSend = now;
								break;
						}
					}
					pUSBCommandPacket->Header.Type = 0xff;				
				}									
			}
		}		
		
		if ((hasRotationData || feedRawMode || hasPositionData || buttonRetransmit) && ticks >= nextSend)
		{
			rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;			
		}
		
		if (readyToSend)
		{
			RF_TransmitMode(&hspi2, RF_InitStruct.RF_TX_Adress); //switch to tx mode
			//HAL_MicroDelay(10);			
			blinkDelay = 100;

			sndCounter++;
			
			//RF_DisableTransmit(&hspi2);
			
			//rfStatus = RF_Status(&hspi2); readyToSend = (rfStatus & RF_TX_STATUS_FULL_Bit) == 0x00 ? 1 : 0;	
			//sendTurn = (sendTurn + 1) % 4;
			
			//4 types of data				
			//uint8_t currTurn = sendTurn;
			
			//if (currTurn == 0)
			{
				if (feedRawMode)
				{	
					//sendTurn = currTurn;
					//send raw data
					USBDataPacket.Header.Type = ctlSource | COMMAND_DATA;
					USBDataPacket.Header.Sequence++;				
					USBDataPacket.Command.Command = CMD_RAW_DATA;
					USBDataPacket.Command.Data.Raw.State = feedRawMode;
					for (int idx=0; idx<3; idx++)
					{
						switch(feedRawMode)
						{
							case RawMode_Raw:
							{
								//raw sensor values
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Raw[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Raw[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Raw[idx];
								break;
							}
							case RawMode_Filtered:
							{
								//filtered sensor data
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Filtered[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Filtered[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Filtered[idx];
								break;
							}
							case RawMode_Compensated:
							{
								//compensated sensor data
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Compensated[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Compensated[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Compensated[idx];
								break;
							}
							case RawMode_DRVectors:
							{
								//deadreckoning vectors
								USBDataPacket.Command.Data.Raw.Accel[idx] = (int16_t)(GravityVector[idx] / aRes);
								USBDataPacket.Command.Data.Raw.Gyro[idx] = (int16_t)(CompAccelVector[idx] / aRes); //in m/s2
								USBDataPacket.Command.Data.Raw.Mag[idx] = VelocityVector[idx] * 1000; //in mm/s
								break;
							}
						}
					}
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;
				}
				//else 
				//	currTurn++;
			}
			//if (currTurn == 1)
			//{	
				if (hasPositionData)
				{					
					//sendTurn = currTurn;
					//send position
					hasPositionData = 0;				
					USBDataPacket.Header.Type = ctlSource | POSITION_DATA;
					USBDataPacket.Header.Sequence++;
					
					//remap
					USBDataPacket.Position.Position[0] = positionQuat.x; //position.Position[0];
					USBDataPacket.Position.Position[1] = positionQuat.z; //position.Position[2];
					USBDataPacket.Position.Position[2] = -positionQuat.y; //-position.Position[1];
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;					
				}
				//else 
				//	currTurn++;
			//} 
			//if (currTurn == 2)
			//{				
				if (hasRotationData)
				{			
					//sendTurn = currTurn;					
					//send rot data
					hasRotationData = 0;				
					USBDataPacket.Header.Type = ctlSource | ROTATION_DATA;
					USBDataPacket.Header.Sequence++;
					//remap				
					USBDataPacket.Rotation.w = orientQuat.w;
					USBDataPacket.Rotation.x = orientQuat.x;
					USBDataPacket.Rotation.y = orientQuat.z;
					USBDataPacket.Rotation.z = -orientQuat.y;					
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;	
				}			
				//else
				//	currTurn++;
			//} 
			//if (currTurn == 3)
			//{
				if (buttonRetransmit)
				{			
					//sendTurn = currTurn;					
					//send trigger data				
					buttonRetransmit--;				
					USBDataPacket.Header.Type = ctlSource | TRIGGER_DATA;
					USBDataPacket.Header.Sequence++;				
					USBDataPacket.Trigger.Analog[0].x = ((float)ADC_Cache[0]) / 200.0f; //trigger
					USBDataPacket.Trigger.Analog[0].y = 0;				
					USBDataPacket.Trigger.Analog[1].x = ((float)ADC_Cache[1]) / 100.0f; //joystick x
					USBDataPacket.Trigger.Analog[1].y = ((float)ADC_Cache[2]) / 100.0f; //joystick y
					USBDataPacket.Trigger.Digital = DigitalCache;
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));				
					rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;									
				}
				//currTurn++;
			//}			
			
			//RF_EnableTransmit(&hspi2);
			//if (!(hasRotationData | hasPositionData | buttonRetransmit | feedRawData))
			do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete			
			
			if (!(feedRawMode || hasPositionData || hasRotationData || buttonRetransmit))
				nextSend = ticks + (extraDelay + (rand() % 10));
			readyToSend = 0;

			HAL_MicroDelay(10);
			RF_ReceiveMode(&hspi2, RF_InitStruct.RF_RX_Adress_Pipe0); //back to rx mode
			//
			//continue;
		}
	}
  /* USER CODE END WHILE */

